app/controllers/reports/detaileds_controller.rb

      scope = build_scope
      @pagy, @entries = pagy(scope.order(started_at: :desc))

      @total_seconds = scope.sum(:duration_seconds)
      @billable_seconds = scope.sum(:duration_seconds)
      @billable_amount = scope.sum("time_entries.duration_seconds * COALESCE(time_entries.hourly_rate_cents, 0) / 360000.0")

      @projects = current_workspace.projects.active.order(:name)
      @clients = current_workspace.clients.active.order(:name)
      @tags = current_workspace.tags.order(:name)
      @users = current_workspace.users.order(:name)
---
SELECT "tags".* FROM "tags" WHERE "tags"."workspace_id" = 1 ORDER BY "tags"."name" ASC
SELECT "users".* FROM "users" INNER JOIN "workspace_memberships" ON "users"."id" = "workspace_memberships"."user_id" WHERE "workspace_memberships"."workspace_id" = 1 ORDER BY "users"."name" ASC

    def export_csv
      @from = params[:from] ? Date.parse(params[:from]) : Date.current.beginning_of_month
      @to = params[:to] ? Date.parse(params[:to]) : Date.current

      entries = build_scope.order(started_at: :desc)

      csv_data = CSV.generate(headers: true) do |csv|
        csv << [ "Date", "Description", "Project", "Client", "Task", "Tags", "User",
                 "Start", "End", "Duration", "Rate", "Amount" ]

        entries.each do |entry|
          csv << [
            entry.started_at.to_date,
            entry.description,
            entry.project&.name,
            entry.project&.client&.name,
            entry.task&.name,
            entry.tags.map(&:name).join(", "),
            entry.user.name,
            entry.started_at.strftime("%H:%M"),
            entry.stopped_at&.strftime("%H:%M"),
            format_duration_csv(entry.duration_seconds),
            entry.effective_rate_cents / 100.0,
            entry.billable_amount
          ]
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (2, 1)
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (3, 1, 2, 4)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN (8, 9, 5, 10, 11, 3, 4, 2, 1)
SELECT "users".* FROM "users" WHERE "users"."id" = 1