app/controllers/reports/detaileds_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (3, 1, 2, 4)
---
      # than per person, so every table in the document has the same shape.
      @show_task_column = @entries.any? { |e| e.task_id.present? }

      @project = current_workspace.projects.find_by(id: params[:project_id])