app/controllers/reports/summaries_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."workspace_id" = 1 ORDER BY "tags"."name" ASC
---
      scope = build_scope

      @total_seconds = scope.sum(:duration_seconds)
      @billable_seconds = scope.billable.sum(:duration_seconds)
      @billable_amount = scope.billable.sum("time_entries.duration_seconds * COALESCE(time_entries.hourly_rate_cents, 0) / 360000.0")

      @chart_data = build_chart_data(scope)

      # Daily breakdown for bar chart
      @daily_data = scope.group("DATE(started_at)")
        .sum(:duration_seconds)
        .sort_by(&:first)
        .map { |date, seconds| { date: date.to_s, seconds: seconds } }

      @projects = current_workspace.projects.active.order(:name)
      @clients = current_workspace.clients.active.order(:name)
      @tags = current_workspace.tags.order(:name)