app/views/feedback_meetings/_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 980190962], ["id", 298486374]]
SELECT "workspace_memberships".* FROM "workspace_memberships" WHERE "workspace_memberships"."workspace_id" = $1 AND "workspace_memberships"."role" IN ($2, $3, $4)  [["workspace_id", 980190962], ["role", 0], ["role", 1], ["role", 2]]
---
    <label class="text-sm font-medium" style="color: var(--color-on-surface-variant)">Employee</label>
    <%= f.select :employee_id,
        current_workspace.workspace_memberships.where(role: [:employee, :admin, :owner]).includes(:user).map { |m| [m.user.name, m.user.id] },
        { prompt: "Select employee" },
        class: "m3-text-field w-full", required: true %>