app/views/holiday_requests/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 980190962], ["id", 298486374]]
---
            <div class="flex items-center gap-3">
              <div class="m3-avatar m3-avatar-sm"><%= request.user.name.first(2).upcase %></div>