app/views/shared/_timer_bar.html.erb

SELECT "tags".* FROM "tags" WHERE "tags"."workspace_id" = 1 ORDER BY "tags"."name" ASC
---
          <div class="hidden absolute right-0 top-full mt-1 m3-menu z-50 w-48">
            <% (Current.workspace&.tags&.order(:name) || []).each do |tag| %>