app/views/shared/_timer_bar.html.erb

        <div class="m3-timer-pill-wrap" data-jira-task-select style="<%= @running_timer.project&.jira_connected? ? 'display:none' : '' %>">
          <%= f.select "time_entry[task_id]",
              @running_timer.project ? options_from_collection_for_select(@running_timer.project.tasks.active, :id, :name, @running_timer.task_id) : [],
              { include_blank: "Task" },
              class: "m3-timer-pill-select",
              data: { action: "change->auto-save#save" } %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1

          <div class="hidden absolute right-0 top-full mt-1 m3-menu z-50 w-48">
            <% (Current.workspace&.tags&.order(:name) || []).each do |tag| %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."workspace_id" = 1 ORDER BY "tags"."name" ASC