app/views/clients/index.html.erb

            <td>
              <span class="text-xs font-medium px-2 py-0.5 rounded-full" style="color: var(--color-outline); background: var(--color-surface-container)"><%= client.projects.size %></span>
---
SELECT "projects".* FROM "projects" WHERE "projects"."client_id" IN (1, 2)