app/views/workspace_members/index.html.erb

            </span>
            <% project_count = membership.user.project_memberships.joins(:project).where(projects: { workspace_id: current_workspace.id }).count %>
---
SELECT COUNT(*) FROM "project_memberships" INNER JOIN "projects" ON "projects"."id" = "project_memberships"."project_id" WHERE "project_memberships"."user_id" = 2 AND "projects"."workspace_id" = 1