app/views/projects/index.html.erb

          <% end %>
          <span class="text-[10px] font-medium text-base-content/40 bg-base-200/80 px-2 py-0.5 rounded-full"><%= project.tasks.size %> tasks</span>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (3, 4, 2, 1)