app/views/projects/show.html.erb

        style: @tab == "members" ? "border-color: var(--color-primary); color: var(--color-primary)" : "color: var(--color-on-surface-variant)" do %>
      Members (<%= @project.project_memberships.count %>)
---
SELECT COUNT(*) FROM "project_memberships" WHERE "project_memberships"."project_id" = 4

            <div class="flex items-center gap-3">
              <div class="m3-avatar m3-avatar-sm"><%= membership.user.name.first(2).upcase %></div>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1