app/views/time_entries/_form.html.erb

SELECT "tags"."id" FROM "tags" INNER JOIN "time_entry_tags" ON "tags"."id" = "time_entry_tags"."tag_id" WHERE "time_entry_tags"."time_entry_id" = 48
---
        <label class="cursor-pointer">
          <%= check_box_tag "time_entry[tag_ids][]", tag.id,
              time_entry.tag_ids.include?(tag.id),
              class: "hidden peer", id: "tag_#{tag.id}" %>