app/controllers/chat_sessions_controller.rb

SELECT "chat_messages".* FROM "chat_messages" WHERE "chat_messages"."chat_session_id" = $1 ORDER BY "chat_messages"."created_at" ASC  [["chat_session_id", 980190962]]
---
        next unless data

        if data["type"] == "assistant"
          text = data.dig("message", "content")&.filter_map { |c| c["text"] }&.join("")

SELECT "tasks".* FROM "tasks" INNER JOIN "projects" ON "projects"."id" = "tasks"."project_id" WHERE "projects"."workspace_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["workspace_id", 980190962], ["id", 298247644], ["LIMIT", 1]]
---
  def set_task
    @task = Task.joins(:project)
               .where(projects: { workspace_id: current_workspace.id })
               .find(params[:jira_task_id])