app/controllers/clients_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."client_id" IN (1, 2)
---
  def index
    @clients = current_workspace.clients.includes(:projects).order(:name)