app/controllers/dashboard_controller.rb

  def show
    today = Date.current
    week_start = today.beginning_of_week(start_day)

    @today_entries = current_workspace.time_entries
      .where(user: current_user)
      .completed
      .for_date(today)
      .includes(:project, :task, :tags)
      .order(started_at: :desc)

    @today_seconds = @today_entries.sum(:duration_seconds)

    @week_entries = current_workspace.time_entries
      .where(user: current_user)
      .completed
      .in_range(week_start, today.end_of_day)

    @week_seconds = @week_entries.sum(:duration_seconds)
    @week_billable_seconds = @week_entries.billable.sum(:duration_seconds)

    last_week_start = week_start - 7.days
    last_week_end = week_start - 1.second
    @last_week_seconds = current_workspace.time_entries
      .where(user: current_user)
      .completed
      .in_range(last_week_start, last_week_end)
      .sum(:duration_seconds)

    @billable_amount = @week_entries.billable.sum("time_entries.duration_seconds * COALESCE(time_entries.hourly_rate_cents, 0) / 360000.0")
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (3, 2, 4)
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (2, 5, 3)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN (8, 9, 5, 10, 11)
SELECT SUM("time_entries"."duration_seconds") FROM "time_entries" WHERE "time_entries"."workspace_id" = 1 AND "time_entries"."user_id" = 1 AND "time_entries"."stopped_at" IS NOT NULL AND "time_entries"."started_at" BETWEEN '2026-03-09' AND '2026-03-12 23:59:59.999999' AND "time_entries"."billable" = TRUE
SELECT SUM(time_entries.duration_seconds * COALESCE(time_entries.hourly_rate_cents, 0) / 360000.0) FROM "time_entries" WHERE "time_entries"."workspace_id" = 1 AND "time_entries"."user_id" = 1 AND "time_entries"."stopped_at" IS NOT NULL AND "time_entries"."started_at" BETWEEN '2026-03-09' AND '2026-03-12 23:59:59.999999' AND "time_entries"."billable" = TRUE