app/controllers/feedback_meetings_controller.rb

  def create
    @feedback_meeting = current_workspace.feedback_meetings.build(feedback_meeting_params)
    @feedback_meeting.creator = current_user

    if @feedback_meeting.save
---
INSERT INTO "feedback_meetings" ("created_at", "creator_id", "employee_id", "notes", "notes_visible", "scheduled_at", "title", "updated_at", "workspace_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @feedback_meeting.update(feedback_meeting_params)
---
UPDATE "feedback_meetings" SET "notes_visible" = $1, "updated_at" = $2 WHERE "feedback_meetings"."id" = $3  [["notes_visible", true], ["updated_at", "2026-04-06 09:44:56.430075"], ["id", 980190962]]

  def destroy
    @feedback_meeting.destroy
---
DELETE FROM "feedback_meetings" WHERE "feedback_meetings"."id" = $1  [["id", 980190962]]

  def set_employees
    @employees = current_workspace.workspace_memberships
      .where(role: [:employee, :admin, :owner])
      .includes(:user)
      .map { |m| [m.user.name, m.user.id] }
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 980190962], ["id", 298486374]]
SELECT "workspace_memberships".* FROM "workspace_memberships" WHERE "workspace_memberships"."workspace_id" = $1 AND "workspace_memberships"."role" IN ($2, $3, $4)  [["workspace_id", 980190962], ["role", 0], ["role", 1], ["role", 2]]