app/controllers/holiday_balance_entries_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]
---
  def index
    if current_user.admin_or_owner?(current_workspace) && params[:user_id].present?
      @target_user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]
---
  def new
    @target_user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
INSERT INTO "holiday_balance_entries" ("created_at", "created_by_id", "days", "entry_type", "holiday_request_id", "note", "updated_at", "user_id", "workspace_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @target_user = User.find(entry_params[:user_id])
    @entry = HolidayBalanceEntry.new(
      user: @target_user,
      workspace: current_workspace,
      entry_type: :admin_adjustment,
      days: entry_params[:days],
      note: entry_params[:note],
      created_by: current_user
    )

    if @entry.save