app/controllers/holiday_requests_controller.rb

SELECT "holiday_requests".* FROM "holiday_requests" WHERE "holiday_requests"."user_id" = $1 AND "holiday_requests"."workspace_id" = $2 ORDER BY "holiday_requests"."start_date" DESC  [["user_id", 298486374], ["workspace_id", 980190962]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 980190962], ["id", 298486374]]
---
  def index
    @balance = current_user.holiday_balance(current_workspace)

    if current_user.admin_or_owner?(current_workspace)
      @pending_requests = current_workspace.holiday_requests
        .pending
        .includes(:user)
        .order(start_date: :asc)

INSERT INTO "holiday_requests" ("business_days", "created_at", "end_date", "note", "reviewed_at", "reviewed_by_id", "start_date", "status", "updated_at", "user_id", "workspace_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @holiday_request = current_workspace.holiday_requests.build(holiday_request_params)
    @holiday_request.user = current_user

    if @holiday_request.save

SELECT "holiday_requests".* FROM "holiday_requests" WHERE "holiday_requests"."workspace_id" = $1 AND "holiday_requests"."id" = $2 LIMIT $3  [["workspace_id", 980190962], ["id", 135173147], ["LIMIT", 1]]
---
  def set_holiday_request
    @holiday_request = current_workspace.holiday_requests.find(params[:id])