app/controllers/jira_controller.rb

  def set_project
    @project = current_workspace.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."workspace_id" = 1 AND "projects"."id" = 2 LIMIT 1