app/controllers/jira_tasks_controller.rb

  def index
    @jira_projects = current_workspace.projects.active.where(external_type: "jira").order(:name)

    if params[:project_id].present?
      @selected_project = @jira_projects.find_by(id: params[:project_id])
    end
    @selected_project ||= @jira_projects.first

    if @selected_project
      @boards = @selected_project.jira_boards.order(:name)
      @selected_board = if params[:board_id].present?
        @boards.find_by(id: params[:board_id])
      end
      @selected_board ||= @boards.first
---
SELECT "projects".* FROM "projects" WHERE "projects"."workspace_id" = 1 AND "projects"."archived" = FALSE AND "projects"."external_type" = 'jira' ORDER BY "projects"."name" ASC LIMIT 1
SELECT "jira_boards".* FROM "jira_boards" WHERE "jira_boards"."project_id" = $1 ORDER BY "jira_boards"."name" ASC  [["project_id", 357876739]]
SELECT "jira_boards".* FROM "jira_boards" WHERE "jira_boards"."project_id" = 2 ORDER BY "jira_boards"."name" ASC LIMIT 1

  def board_data
    @selected_project = current_workspace.projects.find(params[:project_id])
    @selected_board = @selected_project.jira_boards.find(params[:board_id])
    @view_mode = params[:view].presence || "kanban"

    @columns = @selected_board.jira_board_columns.includes(:jira_board_column_statuses)

    tasks = @selected_project.tasks.jira_synced
    if params[:sprint_id].present?
      @selected_sprint = @selected_board.jira_sprints.find(params[:sprint_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."workspace_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["workspace_id", 980190962], ["id", 357876739], ["LIMIT", 1]]
SELECT "jira_boards".* FROM "jira_boards" WHERE "jira_boards"."project_id" = $1 AND "jira_boards"."id" = $2 LIMIT $3  [["project_id", 357876739], ["id", 1052203623], ["LIMIT", 1]]
SELECT "jira_board_column_statuses".* FROM "jira_board_column_statuses" WHERE "jira_board_column_statuses"."jira_board_column_id" IN ($1, $2, $3)  [["jira_board_column_id", 349704796], ["jira_board_column_id", 399035000], ["jira_board_column_id", 1052786883]]
SELECT "jira_sprints".* FROM "jira_sprints" WHERE "jira_sprints"."jira_board_id" = $1 AND "jira_sprints"."id" = $2 LIMIT $3  [["jira_board_id", 1052203623], ["id", 222414261], ["LIMIT", 1]]

  def show
    @task = Task.joins(:project).where(projects: { workspace_id: current_workspace.id }).find(params[:id])

    if turbo_frame_request?
      render partial: "task_detail"
    else
      @selected_project = @task.project
      @boards = @selected_project.jira_boards.order(:name)
---
SELECT "tasks".* FROM "tasks" INNER JOIN "projects" ON "projects"."id" = "tasks"."project_id" WHERE "projects"."workspace_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["workspace_id", 980190962], ["id", 298247644], ["LIMIT", 1]]
SELECT "jira_boards".* FROM "jira_boards" WHERE "jira_boards"."project_id" = $1 AND "jira_boards"."id" IS NULL ORDER BY "jira_boards"."name" ASC LIMIT $2  [["project_id", 357876739], ["LIMIT", 1]]

  def refresh
    project = current_workspace.projects.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."workspace_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["workspace_id", 980190962], ["id", 357876739], ["LIMIT", 1]]