app/controllers/passwords_controller.rb

  def create
    if user = User.find_by(email_address: params[:email_address])
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = $1 LIMIT $2  [["email_address", "[FILTERED]"], ["LIMIT", 1]]

  def update
    if @user.update(params.permit(:password, :password_confirmation))
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2026-03-15 16:16:41.888665"], ["id", 980190962]]