app/controllers/projects_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = 2 AND "tasks"."status" = 0
---
  def show
    @tab = params[:tab] || "settings"
    @tasks = @project.tasks.order(:name)
    @time_entries = @project.time_entries.completed.includes(:user, :task, :tags).order(started_at: :desc).limit(20)
    @total_seconds = @project.time_entries.completed.sum(:duration_seconds)
    @task_time_recap = @project.time_entries.completed
      .where.not(task_id: nil)
      .joins(:task)
      .group("tasks.id", "tasks.name", "tasks.status")
      .sum(:duration_seconds)
      .sort_by { |_, seconds| -seconds }

    if @tab == "members"
      @memberships = @project.project_memberships.eager_load(:user).order("users.name")