app/controllers/project_memberships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
INSERT INTO "project_memberships" ("project_id", "user_id", "hourly_rate_cents", "created_at", "updated_at") VALUES (3, 2, 0, '2026-03-16 11:40:38.108567', '2026-03-16 11:40:38.108567') RETURNING "id"
---
  def create
    user = User.find(params[:user_id])
    @membership = @project.project_memberships.build(
      user: user,
      hourly_rate_cents: (params[:hourly_rate_dollars].to_f * 100).round
    )

    if @membership.save

SELECT "project_memberships".* FROM "project_memberships" WHERE "project_memberships"."project_id" = 3 AND "project_memberships"."id" = 8 LIMIT 1
DELETE FROM "project_memberships" WHERE "project_memberships"."id" = 8
---
  def destroy
    @membership = @project.project_memberships.find(params[:id])
    name = @membership.user.name
    @membership.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."workspace_id" = 1 AND "projects"."id" = 3 LIMIT 1
---
  def set_project
    @project = current_workspace.projects.find(params[:project_id])