app/controllers/projects_controller.rb

  def index
    @projects = current_workspace.projects.includes(:client, :tasks).order(:name)
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (2, 1)
SELECT "projects".* FROM "projects" WHERE "projects"."workspace_id" = 1 ORDER BY "projects"."name" ASC
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (3, 4, 2, 1)

  def show
    @tasks = @project.tasks.order(:name)
    @time_entries = @project.time_entries.completed.includes(:user, :task, :tags).order(started_at: :desc).limit(20)
    @total_seconds = @project.time_entries.completed.sum(:duration_seconds)
    @task_time_recap = @project.time_entries.completed
      .where.not(task_id: nil)
      .joins(:task)
      .group("tasks.id", "tasks.name", "tasks.status")
      .sum(:duration_seconds)
      .sort_by { |_, seconds| -seconds }
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = 1 ORDER BY "tasks"."name" ASC
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (3, 1, 5, 2, 4)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN (3, 4, 2, 1)
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = 1
SELECT SUM("time_entries"."duration_seconds") AS "sum_duration_seconds", "tasks"."id" AS "tasks_id", "tasks"."name" AS "tasks_name", "tasks"."status" AS "tasks_status" FROM "time_entries" INNER JOIN "tasks" ON "tasks"."id" = "time_entries"."task_id" WHERE "time_entries"."project_id" = 4 AND "time_entries"."stopped_at" IS NOT NULL AND "time_entries"."task_id" IS NOT NULL GROUP BY "tasks"."id", "tasks"."name", "tasks"."status"

  def update
    if @project.update(project_params)
---
UPDATE "projects" SET "external_reference" = 'DEV', "external_type" = 'jira', "updated_at" = '2026-03-15 17:28:58.065642' WHERE "projects"."id" = 2

  def set_project
    @project = current_workspace.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."workspace_id" = 1 AND "projects"."id" = 1 LIMIT 1