app/controllers/tags_controller.rb

  def index
    @tags = current_workspace.tags.order(:name)
---
SELECT "tags".* FROM "tags" WHERE "tags"."workspace_id" = 1 ORDER BY "tags"."name" ASC

  def set_tag
    @tag = current_workspace.tags.find(params[:id])
---
SELECT "tags".* FROM "tags" WHERE "tags"."workspace_id" = 1 AND "tags"."id" = 3 LIMIT 1