app/controllers/tasks_controller.rb

  def list
    @project = current_workspace.projects.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."workspace_id" = 1 AND "projects"."id" = 3 LIMIT 1