app/controllers/timers_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
INSERT INTO "time_entries" ("workspace_id", "user_id", "project_id", "task_id", "description", "started_at", "stopped_at", "duration_seconds", "billable", "hourly_rate_cents", "created_at", "updated_at") VALUES (1, 1, 2, NULL, 'DEV-362 Integration to Zenegy (salary platform)', '2026-03-15 17:36:01.228416', NULL, 0, TRUE, NULL, '2026-03-15 17:36:01.236664', '2026-03-15 17:36:01.236664') RETURNING "id"
---
  def start
    existing = current_user.running_timer(current_workspace)
    if existing
      existing.update!(stopped_at: Time.current)
    end

    project = current_workspace.projects.find(params[:project_id]) if params[:project_id].present?

    unless current_user.admin_or_owner?(current_workspace) || project.nil?
      unless ProjectMembership.exists?(project: project, user: current_user)
        redirect_back fallback_location: root_path, alert: "You are not assigned to this project."
        return
      end
    end

    @time_entry = current_workspace.time_entries.create!(
      user: current_user,
      started_at: Time.current,
      description: params[:description],
      project_id: params[:project_id],
      task_id: params[:task_id],
      tag_ids: Array(params[:tag_ids])
    )