app/controllers/timesheets_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (1, 3, 4, 2)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN (2, 8, 4, 11, 3, 9, 5, 10)
---
  def show
    @week_start = if params[:week_of]
      Date.parse(params[:week_of]).beginning_of_week(:monday)
    else
      Date.current.beginning_of_week(:monday)
    end

    @week_days = (0..6).map { |i| @week_start + i.days }

    @entries = current_workspace.time_entries
      .where(user: @viewed_user)
      .completed
      .in_range(@week_start.beginning_of_day, (@week_start + 6.days).end_of_day)
      .includes(:project, :task)

    # Build grid data: { [project_id, task_id] => { date => seconds } }
    @grid = {}
    @entries.each do |entry|

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def set_viewed_user
    if params[:user_id].present? && current_user.admin_or_owner?(current_workspace)
      @viewed_user = current_workspace.users.find_by(id: params[:user_id]) || current_user