app/controllers/time_entries_controller.rb

    scope = current_workspace.time_entries
      .where(user: current_user)
      .completed
      .includes(:project, :task, :tags)

    if params[:project_id].present?
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (3, 2, 4, 1)
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (5, 1, 2, 4, 3)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN (8, 9, 5, 10, 11, 3, 4, 2)

      scope = scope.joins(:time_entry_tags).where(time_entry_tags: { tag_id: params[:tag_id] })
    end

    # Show a week of entries around the selected date
    week_start = @date.beginning_of_week(:monday)
    week_end = @date.end_of_week(:monday)
    @entries = scope.in_range(week_start.beginning_of_day, week_end.end_of_day)
      .order(started_at: :desc)

    @entries_by_day = @entries.group_by { |e| e.started_at.to_date }
    @projects = available_projects
    @tags = current_workspace.tags.order(:name)
---
SELECT "tags".* FROM "tags" WHERE "tags"."workspace_id" = 1 ORDER BY "tags"."name" ASC

  def new
    @time_entry = current_workspace.time_entries.build(started_at: Time.current, user: current_user)
    @projects = available_projects
    @tags = current_workspace.tags.order(:name)
---
SELECT "tags".* FROM "tags" WHERE "tags"."workspace_id" = 1 ORDER BY "tags"."name" ASC

  def create
    @time_entry = current_workspace.time_entries.build(time_entry_params)
    @time_entry.user = current_user

    if @time_entry.save
---
INSERT INTO "time_entries" ("workspace_id", "user_id", "project_id", "task_id", "description", "started_at", "stopped_at", "duration_seconds", "billable", "hourly_rate_cents", "created_at", "updated_at") VALUES (1, 1, 2, NULL, '', '2026-03-03 11:23:00', '2026-03-03 11:33:00', 600, TRUE, 0, '2026-03-16 10:40:20.680008', '2026-03-16 10:40:20.680008') RETURNING "id"

  def edit
    @projects = available_projects
    @tags = current_workspace.tags.order(:name)
---
SELECT "tags".* FROM "tags" WHERE "tags"."workspace_id" = 1 ORDER BY "tags"."name" ASC

  def destroy
    date = @time_entry.started_at.to_date
    @time_entry.destroy
---
DELETE FROM "time_entries" WHERE "time_entries"."id" = 94

  def bulk_update
    ids = params[:time_entry_ids] || []
    entries = current_workspace.time_entries.where(id: ids, user: current_user)

    case params[:bulk_action]
    when "change_project"
      entries.update_all(project_id: params[:project_id].presence, task_id: nil)
    else
      entries.each { |entry| entry.update(bulk_params) }
---
SELECT "time_entries".* FROM "time_entries" WHERE "time_entries"."workspace_id" = 1 AND "time_entries"."user_id" = 1 AND "time_entries"."id" = 48 LIMIT 1

  def set_time_entry
    @time_entry = current_workspace.time_entries.where(user: current_user).find(params[:id])
---
SELECT "time_entries".* FROM "time_entries" WHERE "time_entries"."workspace_id" = 1 AND "time_entries"."user_id" = 1 AND "time_entries"."id" = 94 LIMIT 1