app/controllers/workspace_members_controller.rb

  def index
    @memberships = current_workspace.workspace_memberships.includes(:user).order("users.name")
---
SELECT "workspace_memberships".* FROM "workspace_memberships" WHERE "workspace_memberships"."user_id" = 1 AND "workspace_memberships"."workspace_id" = 1 LIMIT 1
SELECT "workspaces".* FROM "workspaces" INNER JOIN "workspace_memberships" ON "workspaces"."id" = "workspace_memberships"."workspace_id" WHERE "workspace_memberships"."user_id" = 1 AND "workspaces"."id" = 1 LIMIT 1

  def set_membership
    @membership = current_workspace.workspace_memberships.find(params[:id])
---
SELECT "workspace_memberships".* FROM "workspace_memberships" WHERE "workspace_memberships"."workspace_id" = 1 AND "workspace_memberships"."id" = 2 LIMIT 1