app/views/holiday_balance_entries/index.html.erb

    <div class="m3-card-outlined overflow-hidden">
      <% current_workspace.workspace_memberships.where.not(role: :client).includes(:user).order("users.name").each do |membership| %>
---
SELECT "workspace_memberships".* FROM "workspace_memberships" WHERE "workspace_memberships"."user_id" = $1 AND "workspace_memberships"."workspace_id" = $2 LIMIT $3  [["user_id", 298486374], ["workspace_id", 980190962], ["LIMIT", 1]]
SELECT "workspaces".* FROM "workspaces" INNER JOIN "workspace_memberships" ON "workspaces"."id" = "workspace_memberships"."workspace_id" WHERE "workspace_memberships"."user_id" = $1 ORDER BY "workspaces"."id" ASC LIMIT $2  [["user_id", 298486374], ["LIMIT", 1]]

          <div class="flex items-center gap-3">
            <div class="m3-avatar m3-avatar-sm"><%= membership.user.name.first(2).upcase %></div>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 980190962]]