app/models/project_membership.rb

INSERT INTO "rate_changes" ("project_membership_id", "hourly_rate_cents", "previous_rate_cents", "changed_by_id", "changed_at", "created_at", "updated_at") VALUES (9, 0, NULL, 1, '2026-03-16 11:40:38.113043', '2026-03-16 11:40:38.117126', '2026-03-16 11:40:38.117126') RETURNING "id"
---
  def record_initial_rate
    rate_changes.create!(
      hourly_rate_cents: hourly_rate_cents,
      previous_rate_cents: nil,
      changed_by: Current.user,
      changed_at: Time.current
    )