app/models/time_entry.rb

SELECT "project_memberships".* FROM "project_memberships" WHERE "project_memberships"."project_id" = 2 AND "project_memberships"."user_id" = 1 LIMIT 1
---
  def effective_rate_cents
    return hourly_rate_cents unless hourly_rate_cents.nil?
    ProjectMembership.find_by(project_id: project_id, user_id: user_id)&.hourly_rate_cents || 0