app/controllers/concerns/workspace_scoped.rb

  def set_current_workspace
    Current.workspace = current_user.workspaces.find_by(id: session[:workspace_id]) ||
                        current_user.workspaces.first
---
SELECT "workspaces".* FROM "workspaces" INNER JOIN "workspace_memberships" ON "workspaces"."id" = "workspace_memberships"."workspace_id" WHERE "workspace_memberships"."user_id" = 1 ORDER BY "workspaces"."id" ASC LIMIT 1

  def set_running_timer
    return unless Current.workspace
    @running_timer = Current.user
      .time_entries
      .where(workspace: Current.workspace, stopped_at: nil)
      .includes(:tags, :task, :project)
      .first
---
SELECT "projects".* FROM "projects" WHERE "projects"."workspace_id" = 1 AND "projects"."id" = 2 LIMIT 1
SELECT "workspaces".* FROM "workspaces" INNER JOIN "workspace_memberships" ON "workspaces"."id" = "workspace_memberships"."workspace_id" WHERE "workspace_memberships"."user_id" = 1 ORDER BY "workspaces"."id" ASC LIMIT 1