app/views/layouts/application.html.erb

SELECT "workspaces".* FROM "workspaces" INNER JOIN "workspace_memberships" ON "workspaces"."id" = "workspace_memberships"."workspace_id" WHERE "workspace_memberships"."user_id" = 1
---
                <div class="m3-menu-label">Switch Workspace</div>
                <% current_user.workspaces.each do |ws| %>